/* This computer's Internet connection appears to be offline. */
"CONNECTION_DOWN" = "Sambungan Internet komputer ini nampaknya di luar talian.";

/* This computer's Internet connection may be offline. */
"CONNECTION_INDETERMINATE" = "Sambungan Internet komputer ini mungkin di luar talian.";

/* This computer's Internet connection appears to be online. */
"CONNECTION_UP" = "Sambungan Internet komputer ini nampaknya dalam talian.";

/* This computer's DNS server is not responding. */
"NAMESERVER_DOWN" = "Pelayan DNS komputer ini tidak memberi respons.";

/* The DNS server could not find the server name. */
"NAMELOOKUP_FAILED" = "Pelayan DNS tidak menemui nama pelayan.";

/* This computer's router is not responding. */
"ROUTER_DOWN" = "Penghala komputer ini tidak memberi respons.";

/* The server this computer is attempting to connect to is not responding. */
"SERVER_DOWN" = "Pelayan yang komputer ini cuba bersambung tidak memberi respons.";

/* This computer's Internet connection appears to be online. */
"SERVER_UP" = "Sambungan Internet komputer ini nampaknya dalam talian.";

/* Format string for label of a saved password in Keychain: URL (USERNAME) */
"KEYCHAIN_LABEL_FORMAT" = "%@ (%@)";

/* Kind string used for keychain items from forms-based logins */
"KEYCHAIN_WEB_FORM_PASSWORD" = "Kata laluan borang web";

/* HTTP result code string */
"accepted" = "diterima";

/* HTTP result code string */
"bad gateway" = "gerbang rosak";

/* HTTP result code string */
"bad request" = "permintaan rosak";

/* HTTP result code string */
"client error" = "ralat klien";

/* HTTP result code string */
"conflict" = "konflik";

/* HTTP result code string */
"continue" = "teruskan";

/* HTTP result code string */
"created" = "dicipta";

/* HTTP result code string */
"expectation failed" = "jangkaan gagal";

/* HTTP result code string */
"forbidden" = "dilarang";

/* HTTP result code string */
"found" = "ditemui";

/* HTTP result code string */
"gateway timed out" = "gerbang tamat masa";

/* HTTP result code string */
"informational" = "bermaklumat";

/* HTTP result code string */
"internal server error" = "ralat pelayan dalaman";

/* HTTP result code string */
"length required" = "panjang diperlukan";

/* HTTP result code string */
"method not allowed" = "kaedah tidak dibenarkan";

/* HTTP result code string */
"moved permanently" = "dialihkan secara kekal";

/* HTTP result code string */
"multiple choices" = "berbilang pilihan";

/* HTTP result code string */
"needs proxy" = "memerlukan proksi";

/* HTTP result code string */
"no content" = "tiada kandungan";

/* HTTP result code string */
"no error" = "tiada ralat";

/* HTTP result code string */
"non-authoritative information" = "maklumat tidak rasmi";

/* HTTP result code string */
"not found" = "tidak ditemui";

/* HTTP result code string */
"not modified" = "tidak diubah suai";

/* HTTP result code string */
"partial content" = "kandungan separa";

/* HTTP result code string */
"payment required" = "pembayaran diperlukan";

/* HTTP result code string */
"precondition failed" = "prasyarat gagal";

/* HTTP result code string */
"proxy authentication required" = "pengesahan proksi diperlukan";

/* HTTP result code string */
"redirected" = "diubah hala";

/* HTTP result code string */
"no longer exists" = "tidak lagi wujud";

/* HTTP result code string */
"request timed out" = "permintaan tamat masa";

/* HTTP result code string */
"request too large" = "permintaan terlalu besar";

/* HTTP result code string */
"requested URL too long" = "URL yang diminta terlalu panjang";

/* HTTP result code string */
"requested range not satisfiable" = "julat yang diminta tidak dapat dipenuhi";

/* HTTP result code string */
"reset content" = "reset kandungan";

/* HTTP result code string */
"see other" = "lihat lain";

/* HTTP result code string */
"server error" = "ralat pelayan";

/* HTTP result code string */
"service unavailable" = "perkhidmatan tidak tersedia";

/* HTTP result code string */
"success" = "berjaya";

/* HTTP result code string */
"switching protocols" = "menukar protokol";

/* HTTP result code string */
"temporarily redirected" = "diubah hala buat sementara";

/* HTTP result code string */
"unacceptable" = "tidak boleh diterima";

/* HTTP result code string */
"unauthorized" = "tidak dibenarkan";

/* HTTP result code string */
"unimplemented" = "tidak dilaksanakan";

/* HTTP result code string */
"unsupported media type" = "jenis media tidak disokong";

/* HTTP result code string */
"unsupported version" = "versi tidak disokong";

/* kCFErrorHTTPProxyConnectionFailure description */
"Err306" = "Terdapat masalah berkomunikasi dengan pelayan proksi web (HTTP).";

/* kCFErrorHTTPSProxyConnectionFailure description */
"Err310" = "Terdapat masalah berkomunikasi dengan pelayan proksi web selamat (HTTPS).";

/* WebFoundationErrorUnknown description */
"Err-998" = "ralat tidak diketahui";

/* WebFoundationErrorCancelled description */
"Err-999" = "dibatalkan";

/* WebFoundationErrorBadURLError description */
"Err-1000" = "URL rosak";

/* WebFoundationErrorTimedOut description */
"Err-1001" = "Permintaan tamat masa.";

/* WebFoundationErrorUnsupportedURL description */
"Err-1002" = "URL tidak disokong";

/* WebFoundationErrorCannotFindHostError description */
"Err-1003" = "Pelayan dengan nama hos yang ditentukan tidak ditemui.";

/* WebFoundationErrorCannotConnectToHostError description */
"Err-1004" = "Tidak dapat bersambung ke pelayan.";

/* WebFoundationErrorNetworkConnectionLostError description */
"Err-1005" = "Sambungan rangkaian telah terputus.";

/* WebFoundationErrorDNSLookupError description */
"Err-1006" = "Ralat carian DNS";

/* WebFoundationErrorHTTPTooManyRedirectsError description */
"Err-1007" = "terlalu banyak ubah hala HTTP";

/* WebFoundationErrorResourceUnavailableError description */
"Err-1008" = "sumber tidak tersedia";

/* WebFoundationErrorNotConnectedToInternetError description */
"Err-1009" = "Sambungan Internet nampaknya di luar talian.";

/* WebFoundationErrorRedirectToNonExistentLocation description */
"Err-1010" = "diubah hala tanpa tujuan";

/* WebFoundationErrorBadServerResponseError description */
"Err-1011" = "Terdapat respons buruk daripada pelayan.";

/* WebFoundationErrorZeroByteResourceError description */
"Err-1014" = "sumber sifar bait";

/* WebFoundationErrorCannotDecodeRawData description */
"Err-1015" = "tidak boleh menyahkodkan data mentah";

/* WebFoundationErrorCannotDecodeContentData description */
"Err-1016" = "tidak boleh menyahkodkan data kandungan";

/* WebFoundationErrorCannotParseResponse description */
"Err-1017" = "tidak boleh menguraikan respons";

/* kCFURLErrorInternationalRoamingOff description */
"Err-1018" = "Perayauan antarabangsa tidak aktif pada masa ini.";

/* kCFURLErrorCallIsActive description */
"Err-1019" = "Sambungan data tidak boleh diwujudkan memandangkan panggilan aktif pada masa ini.";

/* kCFURLErrorDataNotAllowed description */
"Err-1020" = "Sambungan data tidak dibenarkan pada masa ini.";

/* kCFURLErrorRequestBodyStreamExhausted description.  Should never be seen by an end user. */
"Err-1021" = "strim kandungan yang diminta telah dihabiskan";
	
/* WebFoundationErrorFileDoesNotExist description */
"Err-1100" = "URL yang diminta tidak ditemui pada pelayan ini.";

/* WebFoundationErrorFileIsDirectory description */
"Err-1101" = "fail ialah direktori";

/* WebFoundationErrorNoPermissionsToReadFile description */
"Err-1102" = "Anda tiada kebenaran untuk mengakses sumber yang diminta.";

/* WebFoundationErrorDataLengthExceedsMaximum description */
"Err-1103" = "sumber melebihi saiz maksimum";

/* WebFoundationErrorSecureConnectionFailed description */
"Err-1200" = "Ralat SSL telah berlaku dan sambungan selamat ke pelayan tidak boleh diwujudkan.";

/* WebFoundationErrorServerCertificateHasBadDate description */
"Err-1201" = "Sijil untuk pelayan ini telah tamat tempoh.";

/* WebFoundationErrorServerCertificateHasBadDate description */
"Err-1201.w" = "Sijil untuk pelayan ini telah tamat tempoh. Anda mungkin bersambung ke pelayan yang menyamar sebagai “%@” yang boleh membahayakan maklumat sulit anda.";

/* WebFoundationErrorServerCertificateUntrusted description */
"Err-1202" = "Sijil untuk pelayan ini adalah tidak sah.";

/* WebFoundationErrorServerCertificateUntrusted description */
"Err-1202.w" = "Sijil untuk pelayan ini adalah tidak sah. Anda mungkin bersambung ke pelayan yang menyamar sebagai “%@” yang boleh membahayakan maklumat sulit anda.";

/* WebFoundationErrorServerCertificateHasUnknownRoot description */
"Err-1203" = "Sijil untuk pelayan ini telah ditandatangani oleh pihak berkuasa sijil yang tidak diketahui.";

/* WebFoundationErrorServerCertificateHasUnknownRoot description */
"Err-1203.w" = "Sijil untuk pelayan ini telah ditandatangani oleh pihak berkuasa sijil yang tidak diketahui. Anda mungkin bersambung ke pelayan yang menyamar sebagai “%@” yang boleh membahayakan maklumat sulit anda.";

/* WebFoundationErrorServerCertificateNotYetValid description */
"Err-1204" = "Sijil untuk pelayan ini masih belum sah.";

/* WebFoundationErrorServerCertificateNotYetValid description */
"Err-1204.w" = "Sijil untuk pelayan ini masih belum sah. Anda mungkin bersambung ke pelayan yang menyamar sebagai “%@” yang boleh membahayakan maklumat sulit anda.";

/* WebFoundationErrorClientCertificateRejected description */
"Err-1205" = "Pelayan tidak menerima sijil.";

/* WebFoundationErrorClientCertificateRejected description */
"Err-1205.w" = "Pelayan “%@” tidak menerima sijil.";

/* WebFoundationErrorClientCertificateRequired description */
"Err-1206" = "Pelayan memerlukan sijil klien.";

/* WebFoundationErrorClientCertificateRequired description */
"Err-1206.w" = "Pelayan “%@” memerlukan sijil klien.";

/* WebFoundationErrorCannotLoadFromNetworkError description */
"Err-2000" = "tidak dapat memuatkan daripada rangkaian";

/* WebFoundationErrorCannotCreateFile description */
"Err-3000" = "Tidak boleh mencipta fail";

/* WebFoundationErrorCannotOpenFile description */
"Err-3001" = "Tidak boleh membuka fail";

/* WebFoundationErrorCannotCloseFile description */
"Err-3002" = "Kegagalan berlaku semasa menutup fail";

/* WebFoundationErrorCannotWriteToFile description */
"Err-3003" = "Tidak boleh menulis fail";

/* WebFoundationErrorCannotRemoveFile description */
"Err-3004" = "Tidak boleh mengeluarkan fail";

/* WebFoundationErrorCannotMoveFile description */
"Err-3005" = "Tidak boleh mengalihkan fail";

/* WebFoundationErrorDownloadDecodingFailedMidStream description */
"Err-3006" = "Gagal memuat turun penyahkodan";

/* WebFoundationErrorDownloadDecodingFailedToComplete description */
"Err-3007" = "Gagal memuat turun penyahkodan";

/* Recovery suggestion */
"Would you like to connect to the server anyway?" = "Adakah anda ingin bersambung juga ke pelayan?";

/* Recovery suggestion */
"To change your proxy settings, open Network preferences, click Advanced, and then click Proxies. For help with this problem, contact your system administrator." = "Untuk menukar seting proksi anda, buka Keutamaan rangkaian, klik Lanjutan dan kemudian klik Proksi. Untuk mendapatkan bantuan dengan masalah ini, hubungi pentadbir sistem anda.";

/* AuthBrokerAgent proxy credential user notification - alert header */
"Proxy Authentication Required" = "Pengesahan Proksi Diperlukan";

/* AuthBrokerAgent proxy credential user notification - alert message, args are 1) proxy type, 2) host name, 3) port number, e.g.:  Authentication for HTTP proxy csd3.apple.com:8080 */
"Authentication for %@ proxy\n%@:%d" = "Pengesahan untuk proksi %@\n%@:%d";

/* AuthBrokerAgent proxy credential user notification - Cancel button title */
"Cancel" = "Batal";

/* AuthBrokerAgent proxy credential user notification - Username title */
"Username" = "Nama pengguna";

/* AuthBrokerAgent proxy credential user notification - Password title */
"Password" = "Kata laluan";
